[{"sort_num":2,"color":"lime","type":"img","group":"intro-img","format":"txt","content":"../../../../assets/computer-science/pics/vm1.jpg"},{"sort_num":3,"color":"lime","type":"bdi-text","group":"intro-head","format":"txt","content":"آموزش VMware"},{"sort_num":4,"color":"lime","type":"bdi-text","group":"intro-author","format":"txt","content":"src = ../../../../assets/homepage/media/rasmi.jpg, name = اشکان نصیرزاده , alt = اشکان نصیرزاده"},{"sort_num":5,"color":"darkred","type":"bdi-text","group":"head1","format":"txt","content":"مقدمه"},{"sort_num":6,"color":"darkred","type":"bdi-text","group":"para","format":"txt","content":"نرم افزار VMware دو تا مدل پولی و رایگان داره که پولیه اسمش هست VMware workstation pro و رایگانه اسمش هست VMware workstation player"},{"sort_num":7,"color":"orangered","type":"bdi-text","group":"head1","format":"txt","content":"انتخاب سخت افزار مناسب"},{"sort_num":8,"color":"orangered","type":"bdi-text","group":"para","format":"txt","content":"سیستم عامل های ۳۲ بیتی نهایتا تا ۴گیگ می تونن از ram استفاده کنند که خوب نیست پس ۶۴ بزنید حتما! هسته های پردازنده هم مهمه و بهتره که تمام هسته های cpu رو به نرم افزار مجازی ساز اختصاص ندید مثلا اگه که پردازنده ی ۴هسته ای دارید بهتره که یه هسته رو بدید به ماشین مجازیتون و بقیه رو بذارید برای چیزای دیگه مثلا ماشینای مجازی دیگه<br>برای دیدن اطلاعات cpu خودتون در ویندوز ۱۰ فقط کلمه ی about رو سرچ کنید:<br>"},{"sort_num":9,"color":"orangered","type":"img","group":"img-style1","format":"txt","content":"src = ../../../../assets/computer-science/vmware/1.png"},{"sort_num":10,"color":"orangered","type":"bdi-text","group":"para","format":"txt","content":"بهتره که سرعت cpu تون از 1.5GH بیشتر باشه<br>یادتون نره که میزان ram همیشه از سرعت cpu مهمتر هستش چون وقتی که ram پر می شه به H.D.D منتقل می کنه (paging file) که خیلی performance رو به فنا می ده در نتیجه حداقل ۴ گیگ رمو استاد کنید! در ضمن برای همون paging file که بحثش بود از حجم H.D.D غافل مشوید که حداقل حداقل ۱۰ گیگ هم برای اون باید بگذارید کنار در ضمن برای عملکرد بهتر و در کار های حرفه ای بهتره که دیسک های مستقلی رو برای ماشین های مجازی بذارید کنار<br>"},{"sort_num":11,"color":"darkgoldenrod","type":"bdi-text","group":"head1","format":"txt","content":"نصب VMware"},{"sort_num":12,"color":"darkgoldenrod","type":"bdi-text","group":"para","format":"txt","content":"ماجراش به سادگی هر نصب دیگه ای هست فقط در همون اوایل که Enhanced keyboard ... مطرح هستش بهتره تیکش رو بزنید"},{"sort_num":13,"color":"black","type":"bdi-text","group":"head1","format":"txt","content":"ساخت یک ماشین مجازی"},{"sort_num":14,"color":"black","type":"bdi-text","group":"para","format":"txt","content":"create a new virtual machine رو بزنید<br>گزینه ی custom رو انتخاب کنید<br>در لیستی که تحت عنوان hardware compatibility وجود دارد برای اینکه بتونید جدید ترین نرم افزار ها رو روی ماشین مجازیتون داشته باشید جدید ترین رو انتخاب کنید مثلا روی vm8 نمی تونید نمیتونید windows server 2012 رو روی نصب کنید<br>فعلا لازم نیست سیستم عامل مهمان (guest os) رو انتخاب کنیم بلکه بزنید که سیستم عاملو بعدا نصب می کنم<br>در پنجره ی بعدی windows و windows server 2012 رو انتخاب می کنیم<br>در قسمت بعدی نام vm و همچنین محل قرار گیری فایل های مخصوص اون vm رو انتخاب می کنیم<br>در قسمت بعدی هم نوع firmware رو بهتره بذارید bios<br>در قسمت بعدی numbers of processors یعنی تعداد cpu ها و در قسمت numbers of cores per processor منظور یعنی تعداد هسته ها که من معمولا هر دو رو روی ۲ می گذارم<br>حالا در قسمت بعدی هم میزان رم رو انتخاب می کنیم که در مورد مقادیر مناسبش قبلا حرف زدیم و البته خود wizard هم پیشنهاداتی داره<br>حالا تنظیمات مربوط به کارت شبکه ی مجازی رو داریم که همونطور که می دونید اتصالات شبکه ۴ بخش رو در بر می گیرن و اینجا هم ۴ تا بخش داریم ، در حالت bridge ماشین مجازی می تونه با کارت شبکه واقعی ارتباط داشته باشه و اگر در شبکه ی ما مودم یا DHCP سروری داشته باشیم می تونه از اون آدرس ip رو دریافت کنه، روی حالت NAT ارتباط ماشین مجازی با کارت شبکه ی واقعی قطع می شه و فقط می تونه با ماشین های مجازی دیگه ارتباط برقرار کنه، در حالت host-only ماشین مجازی فقط با ماشین میزبان خودش ارتباط داره و نه با کارت شبکه نه دیگر ماشین های مجازی دیگه ارتباطی نداره و با انتخاب حالت آخر ماشین مجازی فاقد کارت شبکه است، من که اغلب اوقات میذارم روی حالت bridge<br>در قسمت I/O خودش پیش فرض رو روی LSI logic SAS&nbsp; می گذاره که ما هم همونو ادامه می دیم<br>در قسمت بعدی هم که مربوط به نوع DISK هستش بهتره باز هم روی همون حالت پیش فرض بذاریم بمونه<br>در صفحه ی بعدی باید یک H.D.D برای ماشین مجازی درست کنیم با انتخاب گزینه ی create a new virtual disk یک دیسک مجازی جدید می سازیم که partition بندی هم نشده و هیچی هم توش نیست در قسمت بعدی یعنی use an existing virtual disk یعنی از یه دیسکی که قبلا ساختیم استفاده کنیم و مثلا میتونیم از سیستم عامل هایی که روی این H.D.D وجود داره استفاده کنیم در قسمت اخر هم که use a physical disk هستش ماشین مجازی اجازه داره از مثلا یک partition روی ماشین میزبان استفاده کنه که این حالت از سرعت بیشتری برخوداره ولی چون شاید خطری بشه من معمولا یک disk می سازم<br>در قسمت بعدی باید حجم H.D.D رو مشخص کنیم که معمولا خودش با توجه به OS ای که قبلا انتخاب کردیم پیشنهاد می ده نکته اینه که اگر در پایینش تیک allocate رو بذارید کل حجم رو یجا می ده بهش ولی اگر نگذارید کم کم میده هر وقت که خواست ، دو گزینه ی پایینی هم برای تقسیم کردن یا نکردن virtual h.d.d هستش<br>در قسمت بعدی محلی رو برای ذخیره کردن h.d.d ای که ساختید باید مشخص کنید و این محل باید به اندازه ی کافی جا داشته باشه<br>در نهایت کل تنظیماتی که انجام دادید رو می تونید ببینید و در نهایت می تونید finish رو بزنید و عشق و حال<br>"}]