[{"sort_num":"1","color":"black","type":"bdi-noti","group":"danger","format":"txt","content":"این مقاله هنوز تکمیل نشده است"},{"sort_num":"2","color":"lime","type":"img","group":"intro-img","format":"txt","content":"../../../../assets/computer-science/pics/vm1.jpg"},{"sort_num":"3","color":"lime","type":"bdi-text","group":"intro-head","format":"txt","content":"آموزش VMware"},{"sort_num":"4","color":"lime","type":"bdi-text","group":"intro-author","format":"txt","content":"src = ../../../../assets/homepage/media/rasmi.jpg, name = اشکان نصیرزاده , alt = اشکان نصیرزاده"},{"sort_num":"5","color":"darkred","type":"bdi-text","group":"head1","format":"txt","content":"مقدمه"},{"sort_num":"6","color":"darkred","type":"bdi-text","group":"para","format":"txt","content":"نرم افزار VMware دو تا مدل پولی و رایگان داره که پولیه اسمش هست VMware workstation pro و رایگانه اسمش هست VMware workstation player"},{"sort_num":"7","color":"orangered","type":"bdi-text","group":"head1","format":"txt","content":"انتخاب سخت افزار مناسب"},{"sort_num":"8","color":"orangered","type":"bdi-text","group":"para","format":"txt","content":"سیستم عامل های ۳۲ بیتی نهایتا تا ۴گیگ می تونن از ram استفاده کنند که خوب نیست پس ۶۴ بزنید حتما! هسته های پردازنده هم مهمه و بهتره که تمام هسته های cpu رو به نرم افزار مجازی ساز اختصاص ندید مثلا اگه که پردازنده ی ۴هسته ای دارید بهتره که یه هسته رو بدید به ماشین مجازیتون و بقیه رو بذارید برای چیزای دیگه مثلا ماشینای مجازی دیگه<br>برای دیدن اطلاعات cpu خودتون در ویندوز ۱۰ فقط کلمه ی about رو سرچ کنید:<br>"},{"sort_num":"9","color":"orangered","type":"img","group":"img-style1","format":"txt","content":"src = ../../../../assets/computer-science/vmware/1.png"},{"sort_num":"10","color":"orangered","type":"bdi-text","group":"para","format":"txt","content":"بهتره که سرعت cpu تون از 1.5GH بیشتر باشه<br>یادتون نره که میزان ram همیشه از سرعت cpu مهمتر هستش چون وقتی که ram پر می شه به H.D.D منتقل می کنه (paging file) که خیلی performance رو به فنا می ده در نتیجه حداقل ۴ گیگ رمو استاد کنید! در ضمن برای همون paging file که بحثش بود از حجم H.D.D غافل مشوید که حداقل حداقل ۱۰ گیگ هم برای اون باید بگذارید کنار در ضمن برای عملکرد بهتر و در کار های حرفه ای بهتره که دیسک های مستقلی رو برای ماشین های مجازی بذارید کنار<br>"},{"sort_num":"11","color":"darkgoldenrod","type":"bdi-text","group":"head1","format":"txt","content":"نصب VMware"},{"sort_num":"12","color":"darkgoldenrod","type":"bdi-text","group":"para","format":"txt","content":"ماجراش به سادگی هر نصب دیگه ای هست فقط در همون اوایل که Enhanced keyboard ... مطرح هستش بهتره تیکش رو بزنید"},{"sort_num":"13","color":"darkorange","type":"bdi-text","group":"head1","format":"txt","content":"ساخت یک ماشین مجازی"},{"sort_num":"14","color":"darkorange","type":"bdi-text","group":"para","format":"txt","content":"create a new virtual machine رو بزنید<br>گزینه ی custom رو انتخاب کنید<br>در لیستی که تحت عنوان hardware compatibility وجود دارد برای اینکه بتونید جدید ترین نرم افزار ها رو روی ماشین مجازیتون داشته باشید جدید ترین رو انتخاب کنید مثلا روی vm8 نمی تونید نمیتونید windows server 2012 رو روی نصب کنید<br>فعلا لازم نیست سیستم عامل مهمان (guest os) رو انتخاب کنیم بلکه بزنید که سیستم عاملو بعدا نصب می کنم<br>در پنجره ی بعدی windows و windows server 2012 رو انتخاب می کنیم<br>در قسمت بعدی نام vm و همچنین محل قرار گیری فایل های مخصوص اون vm رو انتخاب می کنیم<br>در قسمت بعدی هم نوع firmware رو بهتره بذارید bios<br>در قسمت بعدی numbers of processors یعنی تعداد cpu ها و در قسمت numbers of cores per processor منظور یعنی تعداد هسته ها که من معمولا هر دو رو روی ۲ می گذارم<br>حالا در قسمت بعدی هم میزان رم رو انتخاب می کنیم که در مورد مقادیر مناسبش قبلا حرف زدیم و البته خود wizard هم پیشنهاداتی داره<br>حالا تنظیمات مربوط به کارت شبکه ی مجازی رو داریم که همونطور که می دونید اتصالات شبکه ۴ بخش رو در بر می گیرن و اینجا هم ۴ تا بخش داریم ، در حالت bridge ماشین مجازی می تونه با کارت شبکه واقعی ارتباط داشته باشه و اگر در شبکه ی ما مودم یا DHCP سروری داشته باشیم می تونه از اون آدرس ip رو دریافت کنه، روی حالت NAT ارتباط ماشین مجازی با کارت شبکه ی واقعی قطع می شه و فقط می تونه با ماشین های مجازی دیگه ارتباط برقرار کنه، در حالت host-only ماشین مجازی فقط با ماشین میزبان خودش ارتباط داره و نه با کارت شبکه نه دیگر ماشین های مجازی دیگه ارتباطی نداره و با انتخاب حالت آخر ماشین مجازی فاقد کارت شبکه است، من که اغلب اوقات میذارم روی حالت bridge<br>در قسمت I/O خودش پیش فرض رو روی LSI logic SAS&nbsp; می گذاره که ما هم همونو ادامه می دیم<br>در قسمت بعدی هم که مربوط به نوع DISK هستش بهتره باز هم روی همون حالت پیش فرض بذاریم بمونه<br>در صفحه ی بعدی باید یک H.D.D برای ماشین مجازی درست کنیم با انتخاب گزینه ی create a new virtual disk یک دیسک مجازی جدید می سازیم که partition بندی هم نشده و هیچی هم توش نیست در قسمت بعدی یعنی use an existing virtual disk یعنی از یه دیسکی که قبلا ساختیم استفاده کنیم و مثلا میتونیم از سیستم عامل هایی که روی این H.D.D وجود داره استفاده کنیم در قسمت اخر هم که use a physical disk هستش ماشین مجازی اجازه داره از مثلا یک partition روی ماشین میزبان استفاده کنه که این حالت از سرعت بیشتری برخوداره ولی چون شاید خطری بشه من معمولا یک disk می سازم<br>در قسمت بعدی باید حجم H.D.D رو مشخص کنیم که معمولا خودش با توجه به OS ای که قبلا انتخاب کردیم پیشنهاد می ده نکته اینه که اگر در پایینش تیک allocate رو بذارید کل حجم رو یجا می ده (که بهش می گن thick provision و کارایی بیشتری داره اما فضا رو برای ساخت ماشین های مجازی دیگر کم می کنه) بهش ولی اگر نگذارید کم کم میده هر وقت که خواستن بهشون فضا اختصاص می ده (thin provision که برعکس حالت قبلی هستش ولی خوبی اضافش اینه که در زمان backup گیری صرفه جوبی می کنه) ، دو گزینه ی پایینی هم برای تقسیم کردن یا نکردن virtual h.d.d هستش دو ایتم بعدی هم به این مربوط هستند که یک یا چند فایل (دو گیگ دو گیگ) vmdk برای هاردتون بسازید<br>در قسمت بعدی محلی رو برای ذخیره کردن h.d.d ای که ساختید باید مشخص کنید و این محل باید به اندازه ی کافی جا داشته باشه<br>در نهایت کل تنظیماتی که انجام دادید رو می تونید ببینید و در نهایت می تونید finish رو بزنید و عشق و حال<br><br>اگر سیستم عاملتون رو هنوز نصب نکرده اید (گزینه سوم اونجا رو زدید) باید برید منوی vm و بعد منوی settings و بعد انتخاب cd/dvd و اوکی می کنید و بعد ماشین مجازی رو روشن می کنید<br>بعد از انجام نصب کردن برای نصب vmware tools باید بیایید و از طریق منوی vm-&gt;install vmware tools و بعدش از داخل myComputer ماشین مجازی VMware tools رو انتخاب کرده و مراحل نصب رو انجام می دیم که نصبش باعث افزایش بهره وری ماشین مجازی خواهد شد.<br>"},{"sort_num":"15","color":"darksalmon","type":"bdi-text","group":"head1","format":"txt","content":"تنظیمات ماشین مجازی"},{"sort_num":"16","color":"darksalmon","type":"bdi-text","group":"para","format":"txt","content":"بروید به منوی edit و قسمت preferences:<br><br>"},{"sort_num":"17","color":"darksalmon","type":"img","group":"img-style1","format":"txt","content":"src = ../../../../assets/computer-science/vmware/2.png"},{"sort_num":"18","color":"darksalmon","type":"bdi-text","group":"para","format":"txt","content":"۱- محلی که فایل های مربوط به این ماشین مجازی در اونجا ذخیره میشه<br>۲- می گه آیا ماشین های مجازی ای که روشن هستند بعد از اینکه VMware workstation رو بستید در background روشن بمونند یا نه<br>۳- جایی به درد می خوره که مثلا ماشین مجازیتون رو میخواهید با ورژن های بالاتر VMware workstation سازگاری پیدا کنه یا مثلا می خواهید با سرور های ESX وصل بشید که باید ورژنتون رو به ۵ تقلیل بدهید.<br>۴- اگر همه ی ماشین های مجازی رو یک جا روشن کنید اختلال بازدهی امکان داره ، در نتیجه باید چندین ثانیه بینشون فاصله باشه که اینجا می تونید تعیین کنید چند ثانیه<br>۵- می گه اسکرین شات های می گیری رو کجا باید ذخیره کنید<br>"},{"sort_num":"19","color":"darksalmon","type":"img","group":"img-style1","format":"txt","content":"src = ../../../../assets/computer-science/vmware/3.png"},{"sort_num":"20","color":"darksalmon","type":"bdi-text","group":"para","format":"txt","content":"در این صفحه تنظیمات مربوط به موس و صفحه کلید مجازی رو می تونید انجام بدید:<br>۱- میگه با یه کلیک در داخل محیط ماشین مجازی فرض می کنه که دیگه موس و کیبرد توی ماشین مجازی هستند.<br>۲- کار قبلی منتها با فشردن یک کلید نه زدن یک کلیک<br>۳- به صورت اتوماتیک از داخل کنسول ماشین مجازی خارج میشه در غیر اینصورت برای آزاد کردن موس و صفحه کلید از داخل کنسول ماشین مجازی باید ctrl+alt رو بزنیم.<br>۴- این گزینه به پیدا کردن موس کمک می کنه به این شکل که اگر چند ماشین مجازی روشن باشه و بین اونها در حال حرکت باشیم استفاده از این گزینه پیشنهاد می شه، با انتخاب این گزینه موس در ماشین های مجازی ای که از آنها خارج شدیم نشان داده نمی شود<br>"},{"sort_num":"21","color":"darksalmon","type":"img","group":"img-style1","format":"txt","content":"src = ../../../../assets/computer-science/vmware/4.png"},{"sort_num":"22","color":"darksalmon","type":"bdi-text","group":"para","format":"txt","content":"در این قسمت می توانیم کلید های ترکیبی مختلف مربوط به کار های مختلف ماشین مجازی رو تغییر بدهیم ، برای جلوگیری از تداخل کلید های ترکیبی با ماشین های میزبان این قسمت حتما مورد بررسی قرار بگیرد<br>"},{"sort_num":"23","color":"darksalmon","type":"bdi-text","group":"para","format":"txt","content":"در قسمت های بعدی تقریبا همه چیز معملومه یا خیلی مهم نیست و فقط اشاره کنم که :<br>۱- خاصیت unity برای سهولت در استفاده از ماشین مجازی به کار می ره و با فعال کردنش می تونیم کنسول برنامه ای رو که در ماشین مجازی در حال اجراست روی ماشین میزبان منتقل کنیم.<br>۲- قسمت shared vms برای اتصال بین vmware workstation و vmware webserver هستش<br>۳- در قسمت memory&nbsp; میتونید میزان ram مورد استفاده توسط ماشین مجازی رو کنترل کنید ، سه تا گزینه هم اونجا هست که گزینه ی fit all vm into reserved host ram می گه کل رم رو به صورت فیزیکی بده بهش که این گزینه عملکرد بهتری رو برای شما به ارمغان خواهد آورد ولی باید دقت کنید که با انتخاب این گزینه تعداد ماشین های مجازی ای که همزمان می توانند کار کنند کاهش پیدا می کند. گزینه ی دوم (allow some virtual machine memory to be swaped) مقداری و با انتخاب آخرین گزینه اکثر ram سواپ خواهد شد به عبارت دیگر با انتخاب گزینه های دوم و سوم در صورت نیاز ماشین های مجازی به رم از هارد دیسک مجازی به عنوان رم استفاده خواهد شد.<br>۴- در قسمت priority می توانیم تنظیمات مربوط به اولویت grab شدن موس و کیبرد رو برای ماشین های مجازی و همچنین الویت پردازش اونها رو مشخص کنیم<br>"},{"sort_num":24,"color":"sienna","type":"bdi-text","group":"head1","format":"txt","content":"تنظیمات مختص ماشین مجازی"},{"sort_num":25,"color":"sienna","type":"img","group":"roller","format":"txt","content":"src = ../../../../assets/computer-science/vmware/5.png, alt = |<br>src = ../../../../assets/computer-science/vmware/6.png, alt= |<br>src = ../../../../assets/computer-science/vmware/7.png, alt= |<br>src = ../../../../assets/computer-science/vmware/8.png, alt= |<br>src = ../../../../assets/computer-science/vmware/9.png, alt= |<br>src = ../../../../assets/computer-science/vmware/10.png, alt =&nbsp;<br>"},{"sort_num":26,"color":"sienna","type":"bdi-text","group":"para","format":"txt","content":"در این تنظیمات نیز به چندین نکته اشاره می کنم :<br>۱- دقت کنید که در عکس اول تفاوت دو گزینه اینه که shut down guest یعنی انگار از طریق منو داریم خاموش می کنیم و ماشین مجازی فقط خاموش میشه ولی power off یعنی این که انگار دکمه ی پاور روی کیس یا صفحه کلید رو زدید. خلاصه فرقشون اینه که یک طرف حالت نرم افزاری داره و یک طرف به شکل سخت افزاری کار انجام می شه<br>۲- در عکس دوم shared folder رو می بینیم که خاصیتی است که قابلیت اشتراک فایل ها و فولدر ها رو بین میزبان و میهمان فراهم می کنه و دقت کنید که این مسئله امکان دسترسی به فایل های کامپیوتر میزبان رو فراهم می کنه ، بعد از اینکه این خاصیت رو enabled کردید باید روی دکمه ی add کلیک کنید تا اینکه فولدری یا فایلی که می خواهید از ماشین میزبان به اشتراک بگذارید رو تحت عنوان host path مشخص کنید و باقی مراحل رو طی کنید.<br>۳- در قسمت auto protect باید مشخص کنید که هر چند وقت یکبار می خواهید snapshot بگیرید.<br>۴- در عکس چهارم میبینید که این امکان وجود دارد که از ماشین های مجازی به عنوان vnc server استفاده شود و در این قسمت می توانیم تنظیمات مربوط به کلاینت های vnc رو انجام بدهیم ، vnc یک برنامه ی remote است که در ماشین های مجازی قرار داده شده که می توانیم به وسیله ی اون به desktop ماشین های مجازی دسترسی داشته باشیم<br>۵- در قسمت unity باز هم می توانیم تنظیمات نمایش جداگانه ی پنجره هایی از ماشین مجازی رو روی ماشین میزبان داشته باشیم مثلا این که رنگ دور پنجره های ماشین مجازی چه رنگی باشه یا ...<br>۶- در عکس ششم تنظیمات مربوط به قسمت advanced رو میبینیم ، شماره ی ۱ در اینجا در مورد خاصیت trimming صحبت می کنه که تکنولوژی ای هست که باعث می شه فضای بلااستفاده ی hard disk مجازی به ماشین میزبان داده بشه تا ماشین میزبان بتونه برای مصارف دیگه ازش استفاده کنه پس بهتره که فعال باشه، با فعال بودن گزینه ی دوم اطلاعات بیشتری از ماشین مجازی گرفته می شه که این کار به عیب یابی بهتر و دقیق تر منجر می شود و از پاک شدن ماشین های مجازی به صورت سهوی جلوگیری می کند که برای اون کار باید با انتخاب گزینه ی بعدی ماشین مجازی رو به عنوان یک template انتخاب کنیم.<br>"},{"sort_num":27,"color":"darkgrey","type":"bdi-text","group":"head1","format":"txt","content":"افزودن قطعات به ماشین مجازی"},{"sort_num":28,"color":"darkgrey","type":"img","group":"img-style1","format":"txt","content":"src = ../../../../assets/computer-science/vmware/11.png"},{"sort_num":29,"color":"darkgrey","type":"bdi-text","group":"para","format":"txt","content":"مثلا فرض کنید می خواهید یک کارت شبکه به سیستم مجازیتون اضافه کنید مراحل انجام این کار در این تصویر مشخص شده است."},{"sort_num":30,"color":"darkmagenta","type":"bdi-text","group":"head1","format":"txt","content":"اضافه کردن hard disk مجازی به ماشین مجازی"},{"sort_num":31,"color":"darkmagenta","type":"bdi-text","group":"para","format":"txt","content":"برای این کار لازم نیست که ماشین مجازی خاموش باشه.<br>برای این کار وارد setting ماشین مجازی می شیم و پس از انتخاب hard disk روی آن را add می کنیم بعدش برای اضافه کردنش به ماشین مجازی اگر ویندوز باشد وارد disk management می شویم و پارتیشن مورد نظر را انتخاب کرده ، رایت کلیک کردن و online اش می کنیم و سپس رایت کلیک مجدد می کنیم و initialize disk می کنیم و تنظیماتش را انجام می دهیم سپس روی آن دوباره رایت کلیک کرده new sample volume را زده و تنظیمات را دوباره انجام می دهیم.<br>"},{"sort_num":32,"color":"darkmagenta","type":"bdi-text","group":"head2","format":"txt","content":"defragment"},{"sort_num":33,"color":"darkmagenta","type":"bdi-text","group":"para","format":"txt","content":"مثل یک دیسک فیزیکی واقعی ، دیسک های مجازی هم می توانند دچار به هم ریختگی و پراکندگی اطلاعات بشوند ، عمل defragment گپ هایی که بین اطلاعات در دیسک وجود دارد را از بین می برد.<br>برای این کار از طریق ماشین مجازی طبق عکس زیر عمل می کنیم (در اینجا به علت این که ماشین مجازی روشن است گزینه ها غیر فعال هستند):<br>"},{"sort_num":34,"color":"darkmagenta","type":"img","group":"img-style1","format":"txt","content":"src = ../../../../assets/computer-science/vmware/12.png"},{"sort_num":35,"color":"darkmagenta","type":"bdi-text","group":"para","format":"txt","content":"نکته ی مهم اینه که این عملیات می تونه از طریق خود windows هم انجام بشه و باید دقت کنید که&nbsp; در زمانی که هارد دیسک شما از نوع thin باشه فقط از طریق نرم افزار vmware این کار رو انجام بدید و انجام این عمل از داخل خود ماشین مجازی ویندوز فقط برای هارد دیسک های thick انجام شود."},{"sort_num":36,"color":"darkmagenta","type":"bdi-text","group":"head2","format":"txt","content":"compact"},{"sort_num":37,"color":"darkmagenta","type":"bdi-text","group":"para","format":"txt","content":"عمل کامپکت یکی دیگر از تنظیمات و اعمال مدیریتی که می توانیم بر روی دیسک های مجازی انجام بدیم عمل فشرده کردن آن هاست بر این اساس می توانیم فضای آزاد دیسک مجازی را به منظور کاهش سایز ماشین مجازی همینطور برگرداندن فضای بدون استفاده به هارد دیسک فیزیکی فشرده کرد به این منظور وارد تنظیمات هارد دیسک می شویم و بر روی دکمه compact کلیک می‌کنیم نکته‌ای که در این مرحله باید به آن توجه کنیم آن است که اگر آن hard disk که برای ماشین مجازیمون در نظر گرفتیم اگر از نوع pre allocate باشد یعنی کل فضا رو یکجا برایش اختصاص دادیم امکان compact نمودن برای آن وجود ندارد"},{"sort_num":38,"color":"darkmagenta","type":"bdi-text","group":"head2","format":"txt","content":"disk cleanup"},{"sort_num":39,"color":"darkmagenta","type":"bdi-text","group":"para","format":"txt","content":"وقتی که یک فایلی مثلا به حجم ۳گیگ رو از روی ماشین مجازی delete می کنیم این ۳گیگ به ماشین مجازی برنمی گردد و نیازمند diskcleanup هستیم در اینجا<br>diskcleanup همون compact هست با این تفاوت که خفن تره و بیشتر جا باز می کنه و همچنین نسبت به defragment جایی رو برای این کار اشغال نمی کنه<br>برای انجام عمل disk clean up دقت کنید که باید اول ماشین مجازی خاموش باشد و سپس طبق عکس زیر عمل می کنید:<br>"},{"sort_num":40,"color":"darkmagenta","type":"img","group":"img-style1","format":"txt","content":"src = ../../../../assets/computer-science/vmware/13.png"},{"sort_num":41,"color":"darkmagenta","type":"bdi-text","group":"para","format":"txt","content":"سپس روی دکمه ی cleanup disk کلیک کنید"},{"sort_num":42,"color":"darkmagenta","type":"bdi-text","group":"head2","format":"txt","content":"expand"},{"sort_num":43,"color":"darkmagenta","type":"bdi-text","group":"para","format":"txt","content":"عمل expand به معنای اضافه کردن فضا به هارد دیسک مجازی هستش و از همون جایی که defragment رو انجام دادیم قابل دسترسی هست و بعدش باید فضای جدیدی که برای دیسک مجازی در نظر دارید رو بنویسید و بعد از انجام مراحل (دقت کنید که قبلش باید ماشین مجازی خاموش بوده باشد و snapshot یا clony نداشته باشد و دیسک مجازی به صورت map پیکره بندی نشده باشد) حالا باید ماشین مجازی رو روشن کنید و win+x و وارد disk management می شویم سپس طبق عکس زیر عمل کرده و بعدشم چند تا next می زنیم تا اوکی بشه"},{"sort_num":44,"color":"darkmagenta","type":"img","group":"img-style1","format":"txt","content":"src = ../../../../assets/computer-science/vmware/14.png"},{"sort_num":45,"color":"darkblue","type":"bdi-text","group":"head1","format":"txt","content":"قابلیت map virtual disk"},{"sort_num":46,"color":"darkblue","type":"bdi-text","group":"para","format":"txt","content":"با استفاده از این قابلیت این امکان فراهم می شود که ماشین میزبان به دیسک ماشین مجازی دسترسی داشته باشه<br>برای این کار از منوی file گزینه ی map virtual disk رو می زنیم و توجه داریم که حتما ماشین مجازی خاموش بوده باشد سپس بر روی دکمه ی map کلیک می کنیم سپس فایل vmdk مربوط به دیسک مجازی رو انتخاب می کنیم (برای دسترسی کامل تیک open file in read-only mode رو بردارید)<br>نکته ی خیلی مهم این که اگر پارتیشن مپ شده ی ایجاد شده رو disconnect نکنید امکان استفاده از ماشین مجازی رو از دست خواهید داد، برای این کار حتما باید رو پارتیشن ایجاد شده رایت کلیک کنید و گزینه ی disconnect virtual disk رو انتخاب کنید.<br>"},{"sort_num":47,"color":"royalblue","type":"bdi-text","group":"head1","format":"txt","content":"تنظیمات advanced مربوط به virtual disk"},{"sort_num":48,"color":"royalblue","type":"img","group":"img-style1","format":"txt","content":"src = ../../../../assets/computer-science/vmware/15.png"},{"sort_num":49,"color":"royalblue","type":"bdi-text","group":"para","format":"txt","content":"در صورتی که Independent رو انتخاب بکنیم دیسک هایی به وجود خواهند اومد که عملکرد مستقلی دارند و تحت تاثیر snapshot قرار نمی گیرند و در واقع snapshot روشون اثری ندارد، در صورت انتخاب persistent تغییرات یکجا اعمال و به صورت دائمی روی دیسک قرار می گیرد و در صورت انتخاب nonpersistent تغییرات پس از یک بار ریست شدن دوباره به حالت اول برمیگردند و به صورت دائمی بر روی دیسک قرار نمی گیرند"},{"sort_num":50,"color":"darkseagreen","type":"bdi-text","group":"head1","format":"txt","content":"snapshot"},{"sort_num":51,"color":"darkseagreen","type":"bdi-text","group":"para","format":"txt","content":"یکی از قابلیت های نرم افزار VMware قابلیت snapshot گیری از ماشین های مجازی است، با استفاده از snapshot می توانیم از وضعیت کنونی ماشین مجازی نسخه ی backup تهیه کنیم سپس روی ماشین مجازی تغییراتی رو ایجاد کنیم که اگر در این بین به مشکلی برخورد کردیم می توانیم با اعمال snapshot به حالت اولیه برگردیم، مثلا فرض کنید زمانی که یک ویندوز رو نصب کردیم از اون یک اسنپ شات تهیه می کنیم و بعد اگر برای ویندوز اصلی مشکلی پیش بیاید دیگه غمی نداریم ."},{"sort_num":52,"color":"darkseagreen","type":"bdi-text","group":"head2","format":"txt","content":"تهیه ی snapshot"},{"sort_num":53,"color":"darkseagreen","type":"bdi-text","group":"para","format":"txt","content":"برای این کار منوی vm سپس snapshot سپس take snapshot رو انتخاب می کنیم .<br>در این قسمت می توانیم یک نام و در صورت تمایل توضیحی رو برای این snapshot انتخاب می کنیم و سپس روی گزینه ی take a snapshot کلیک می کنیم ، حالا اگر بخواهیم به این snapshot برگردیم می ریم به منوی vm سپس گزینه ی snapshot و سپس گزینه ی revert to snap shot رو انتخاب کنیم&nbsp;<br>"},{"sort_num":54,"color":"darkseagreen","type":"bdi-text","group":"head2","format":"txt","content":"snapshot manager"},{"sort_num":55,"color":"darkseagreen","type":"bdi-text","group":"para","format":"txt","content":"در صورتی که در زمان تهیه ی snapshot ماشین مجازی روشن باشد از حافظه نیز snapshot تهیه می شود.<br>برای رفتن به snapshot manager به منوی vm سپس snapshot سپس snapshot manager می رویم&nbsp;<br>"},{"sort_num":56,"color":"darkorchid","type":"bdi-text","group":"head1","format":"txt","content":"clone گرفتن از ماشین مجازی"},{"sort_num":57,"color":"darkorchid","type":"bdi-text","group":"para","format":"txt","content":"پروژه ی ایجاد یک ماشین مجازی و نصب سیستم عامل روی اون بسیار وقت گیر است بنابراین می توانیم از ابزار clone استفاده کنیم برای این کار:"},{"sort_num":58,"color":"darkorchid","type":"img","group":"img-style1","format":"txt","content":"src = ../../../../assets/computer-science/vmware/16.png"},{"sort_num":59,"color":"darkorchid","type":"bdi-text","group":"para","format":"txt","content":"برای این کار می توانستیم از طریق vm menu -&gt; manage -&gt; clone هم اقدام کنیم.<br>نکته : تقاوت linked clone و full clone اینه که full clone یک سخت افزار جدید هم داره و کاملا مستقل هست ولی linked clone برای زمانیه که ماشین مجازی رو می خواهیم به سرعت بسازیم و سریعا تحت آزمایشات متعدد قرار بدهیم ولی ماجرا اینه که در صورت استفاده از نسخه ی linked clone هر اشکالی روی نسخه ی clone به وجود بیاید روی نسخه ی اصلی هم خواهد بود که خیلی بده<br>"},{"sort_num":60,"color":"darkcyan","type":"bdi-text","group":"head1","format":"txt","content":"فایل های ماشین مجازی"},{"sort_num":61,"color":"darkcyan","type":"bdi-text","group":"para","format":"txt","content":"بعد از ساخت یک ماشین مجازی در داخل نرم افزار vmware workstation تعدادی فایل با پسوند های خاص بر روی ماشین میزبان ساخته می شوند که حاوی اطلاعات مربوط به ماشین مجازی ساخته شده است در ادامه به بررسی فایل های مختص ماشین مجازی می پردازیم:<br>برای دیدن مسیر این فایل ها بر روی ماشین میزبان می توانیم در نرم افزار vmware workstation به منوی edit -&gt; preferences برویم و در زیر قسمت workspace می توانیم مسیر مربوط به فایل های ماشین مجازی رو مشاهده کنیم.<br>۱- vmx : فایل پیکره بندی ماشین مجازی ، در این فایل متنی اطلاعاتی همچون هارد، سی پی یو ، رم ، network interface و اطلاعات مربوط به vmware tools<br>2- log : فایل متنی که با پسوند .log مشخص می شود کلیه ی log های مربوط به ماشین مجازی در اون ذخیره می شود و برای troubleshooting از این فایل ها می توانیم استفاده کنیم و به ازای هر سیکل روشن و خاموش شدن ماشین مجازی یک فایل log ایجاد می شود.<br>۳- nvram : محل ذخیره اطلاعات bios ماشین مجازی برای نگاه داری تنظیمات bios از اون استفاده می شود و فرمتش باینری است (نه متنی) و اگر پاک بشود در زمان روشن شدن ماشین مجازی با تنظیمات پیش فرض ایجاد می شود .<br>۴- vmsd : در این فایل ها اطلاعات مختص به نگه داری snapshot ذخیره می شود.<br>۵- vmdk :‌ فایل های مختص به دیسک مجازی از ماشین مجازی&nbsp;<br>۶- vmem : فایل هایی که با روشن شدن ماشین مجازی ساخته می شوند و حافظه ی مجازی مختص به ماشین مجازی است<br>"},{"sort_num":62,"color":"darkgreen","type":"bdi-text","group":"head1","format":"txt","content":"انتقال ماشین های مجازی"},{"sort_num":63,"color":"darkgreen","type":"bdi-text","group":"para","format":"txt","content":"جابجایی ماشین های فیزیکی به صورت سخت افزاری انجام می شه اما ماشین های مجازی رو در یک فایل کپسوله می کنیم و به صورت مجازی منتقل می کنیم ، برای انتقال ماشین مجازی فقط باید فایل های آن را کپی و در جایی که می خواهیم paste بکنیم اما قبلش باید آن ها را خاموش کنیم.<br>نکته :‌ مشخصات سخت افزاری ماشین مبدا و مقصد برای انتقال ماشین های مجازی باید یکسان باشند .<br>برای اطلاعات بیشتر برای این امر باید کمی در گوگل گشت و گذار کنید!<br>"},{"sort_num":64,"color":"darkgreen","type":"bdi-text","group":"head2","format":"txt","content":"انتقال و به اشتراک گذاری ماشین های مجازی"},{"sort_num":65,"color":"darkgreen","type":"bdi-text","group":"para","format":"txt","content":"در این بحث می خواهیم ماشین های مجازی رو ایجاد و ارتباط بین آن ها را آزمایش و چک کنیم . vid-5-00.35.55"}]